[{"title": "Sales Executive,Executive,\"FMCG Sales Executive\"", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=aYV__SLASH__9k2gBFNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Achieve the sales revenue target in the assigned territoryChannel Development and Infrastructure (Distributors / Retailers)Monitor the performance of distributors, preferred retailers & take corrective actionsHandling Dealership related issues and challenges, achieving dealer business plan (for sales, manpower recruitment, funds, coverage, activities).Process ComplianceAggressive execution of Sales programs (i.e. new schemes / promotions / trade engagement etc.)Channel Management (Distributor / FOS / Retailer) to improve productivity and sales capabilities.Ensure optimum utilization of the territory by building up customer base / retailer networkIncrease market share of one s territory. Analyzing the market by collecting RTO DataTimely Collection of the market information such as competitor activities & initiatives and analyze the same with the help of Area Sales Manager to pre-empt its impact on the businessCommunication and Interpersonal Skills, Retail Market Expertise. Must be conversant with the local market & have the Sales Skills to achieve the Targets at the assigned territory.", "companyname": "SAROJ AGRO INDUSTRIES", "location": "Bengaluru / Bangalore,  Mangalore,  Mysoru / Mysore,  Other City(s) in Karnataka", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "sales, marketing, fmcg", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "\"freelance sales\",sales", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=19tv484LF0BzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Freelance Sales Professionals required. Excellent commission structure. Potential to earn 40k to 100k per month.Products : Medical Equipments and Supplies.About the company:Global trading company Deals with all kinds of hospital Equipments like instruments in diagnostics For Example stethoscope, pulse oximeter, BP monitors, Vein Detector, Thermometer, Tuning Fork, Pen light, Otoscope, Needle Cutter etc.Lab equipments like Microscope, stirrers, autoclave, Urine Analysis, Pregnancy test kits, POC diagnostic, Centrifuge, Immuno Assay etc.Surgical instruments like scissors, needle holder, forceps, clamps, BP handle, Student Kit, Dengu and malaria rapid tests, Retracters etcIf interested kindly apply here.Regards,Ashish GangadharanHR Department", "companyname": "Right Match Global", "location": "Belgaum,  Bengaluru / Bangalore,  Mangalore,  Mysoru / Mysore", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "Sales, Business development, marketing", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "FRESHERS ,GRADUATE PARTNER,CAMPUS TO ENTERPRENEUR", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=CV7ARMN6I0hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "CANDIDATES FROM BANGALORE LOCATION ONLY NEED APPLY.AN MNC is looking for Fresh graduates / Post Graduates in any descipline but BBA/MBA Preferred with Finance/Marketing/Accounts/ Sales and Distribution are preferred. Eligibilty: Graduates passed in 2019-20 or 2020-21 can apply.Good communication skills is a must:Languages known: English, Telugu, Tamil or Kanada and HindiPAY PACKAGE: SALARY, PF, PERFORMANCE BONUS, BLAST OFF BONUS AS PER COMPANY TERMS AND CONDITIONS BASED ON THE CANDIDATE'S PERFORMANCE.", "companyname": "peopletrn", "location": "Bengaluru / Bangalore", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "GRADUATE TO BECOME PARTNER", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Hiring Web Methods Developer - MNC - Bangalore", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=KPVQjXBvmJ1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Title: Web Methods DeveloperExperience: 6 - 8 yearsLocation: BangaloreRequired Skills: Java/Web methods/Integration/Migration/JMS/Design/FrameworksJob Description:Understand the functional analysis documents created by the functional analystAbout 6 to 8 years of extensive application Integration experience, of which 5+ years is in webMethods application development utilizing Integration Server, MWS, Broker, Trading Network, Adapters such as JDBC, MQ, JMS, B2Bi/EDI processing, A2A processing, wM translator/mapping.Responsible for project deliverables such as architecture diagrams and design documents. Participate in high level and detailed design activitiesCreate and review a technical designMust be adept at using webMethods Designer. Must have experience on webMethods 8.X or above administration activities such as IS, TN, Broker, Adapter and JMS configuration, maintenance, troubleshooting, Framework development and migration etc.webMethods flow CodingPrepare, perform and review unit test plansPrepare, perform and review system test plansMaintain your personal personal planningEnsure proper documentationExecute and support start-up/go-liveProject planning and coordination ( understand, prepare and monitor a WBS, project estimation and project plan)Log, track and close defectsProvide inputs to tech lead in estimationsTake up support activitiesUnderstand, follow and practice the ICC governance standards, processes and help program teams to implement the same through the technical solutionsProvide guidance and support to junior team members in Middleware Integration CompetenciesGood at mentoring Junior developers on latest development trends and frameworksGood at coordination with larger communities to work together towards a goal stateGood at root cause analysis, troubleshoot and resolve any technical issues relating to middleware integration applicationsDevelop and maintain good relationships between various teams across domainsGood in verbal and written communication skills and presentation skillsInterested can reach me @8939977100 / share your resume to following id ghayathri . spstaffing @ gmail . com Thanks and Regards,Ghayathri.M Talent AcquisitionSP Staffing Service pvt ltd", "companyname": "SP STAFFING SERVICES", "location": "Bengaluru / Bangalore", "experience": "5 - 9 yrs", "salary": "", "type": "", "skills": "JAva, Web Methods, Webmethods, Soa, JMS, Java message Service, Migration, Integration, Design, JDBC, MQ, Integration Server, MWS", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Junior Architect", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=MnuoF8f0v7hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsibilities:- Conceptual ArchitecturalPlanning with Vastu Design in High-End Residential Project, Commercial Project, IndustrialProject, Stall Design, Farmhouse Project, etc.- Architectural detail drawing like centerline, plan, elevation, section, plumbing. Electric,fabrication etc.- RMC RUDA submission design- Non-agriculture layout work- Structuredesign, drafting work- Green Building design- Temple Design- Jain Upashrya Dersar work- Land Survey Work- Sewage Treatment Plant- Airport NOC, Fire NOC NOC work- MEP Design- Interior Design work- Landscape Design- BOQ, Loan Estimate- ValuationWorkRequirement:- Proven working experience as a Junior Architect- Strong portfolio to prove artistic skills- Expert knowledge of building products, construction details, and relevant rules, regulations, and quality standards- Excellent drawing skills and familiarity with design software (Adobe Photoshop, SketchUp, 3d Studio VIZ, AutoCAD, Zwcad, Sketch-up, 3D max, MS office, Coral draw)- Strong imagination and the ability to think and create in three dimensions- Visual awareness and an eye for detail- Communication and project management skillsRequired Education: Diploma in Architecture or Bachelor in Architecture", "companyname": "Spot In Job Consultancy", "location": "Bengaluru / Bangalore,  Pune,  Rajkot", "experience": "1 - 6 yrs", "salary": "", "type": "", "skills": "Junior Architect, Architectural Planning, RMC RUDA, Vastu, MEP Design, Landscape Design, boq", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Quality Assurance (QA) Engineer,mechanical,instrumentation", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Imx__PLUS__R9gd689zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Role - In charge for QAQualification: Diploma in Mechanical Engg./ Instrumentation Engg.Designation: Sr. TechnicianReporting to: Production ExecutiveAge: -- 24-28 Yrs.Work Experience: -- 3 5 Yrs in a medium/large Jewellery Mfg. setup with hands on experience in Quality Assurance.Work description:- Responsible to develop Quality systems and have Quality processes deployed across Upstream (Assaying, Alloying, Rolling, Refining, Casting) & Downstream (B/w, Stone setting, Finishing) operations and covering procurement and sourcing.- Ensure the purity of gold across the Mfg. system, with proper checks along the value chain.- Ensuring that the processes are monitored, measured and corrected if reqd. to achieve the objectives, which is CKCIFJs Mfg. setup is with World class Quality Processes - Assist each of the mfg. section heads to develop quality processes and also train individuals to be self-reliant in their respective domain from a quality perspective.- Develop a robust system to ensure that the quality of diamonds used are in line with specs.- Responsible to establish a quality system to ensure no infiltration of Lab grown diamonds into the products and only natural diamonds are embellished into studded products.Send CV / Call us to discuss further.Sirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA Consulting", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "3 - 5 yrs", "salary": "", "type": "", "skills": "Jewellery Manufacturing, mechanical, instrumentation", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Mechanical Production Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=tIOlTeEiFp1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Role - In charge for Production (B/W, SET, POL)Qualification: Diploma in Mechanical Engg.Designation: Sr. TechnicianReporting to: Production ExecutiveAge: -- 24-28 Yrs.Work Experience: -- 3 5 Yrs in a medium/large Jewellery Mfg. setup with hands on experience in B/W, Stone Setting & Finishing.Work description:- The incumbent will be responsible to run the downstream operations productively.- Responsibility covers Bench working (Component Assly.), Stone setting & Finishing processes.- Needs to have utmost focus on Quality at all stages of the processes and ensure that SOPs are adhered, without any exception.- Coordinate with other depts. And ensure product delivery as per plan. - Needs to foster high levels of skills development in his team members and work for developing quality processes and sustain them.- Develop his team members into one-man cell, each one of them picking skills of B/W, Stone setting & Finishing Oprns.- Enable the team members to deliver Quality products within optimum time, while adhering to the quality standards of processes and products.- Instrumental in initiating Innovative Improvements to the Mfg. processes to further Quality and Productivity.Send CV / Call us to discuss further.Sirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA Consulting", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "3 - 5 yrs", "salary": "", "type": "", "skills": "Jewellery Manufacturing, Mechanical, Engineering", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Web Designer/Developer,1 - 3 years Experience,Nr Ulsoor Lake", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Y7lYeMe__SLASH__w__SLASH__tzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Web Developer | 1 to 3 Yrs | Nr Ulsoor LakeQualification : Diploma / Bachelor in Computer Science/ITExperience : 1 to 3 YearsSalary : 20 to 25KRequirement :- HTML/XHTML, CSS, JavaScript- Server-side frameworks such as python, ruby, php, Java, ASP, ASP.NET- Database systems such as SQL and OracleRoles & Resposibilities :- Creating & maintaing websites- Maintaining software documentation- Working closely with web designers and programmers to produce the websiteSend CV / Call us to discuss further.Sirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA Consulting", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "1 - 3 yrs", "salary": "", "type": "", "skills": "HTML XHTML, CSS, JavaScript, python, ruby, php, Java, ASP, ASP.net, SQL, Oracle", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Program Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=abZG9Ne7__SLASH__UlzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Data Entry and Telephonic Calling :Data entry and updating of patient data baseEffective communication with patients / caregivers on the queries related to enrollment in the programVerify the documents received and process enrollmentsMaintain and file patient wise documentationMake sure the enrollments are processed on time as per guidelinesDiscussion with patients on price as per guidelinesSeeking approvals for special discounts and documentationOn time follow up with patients on the status of PSP approvals or dispatching of medicineTo call patients at defined frequency which is planned at the beginning of the monthRecord all details (enrollment, orders, follow ups) in the system for the calls done / received from patientsRoute calls to appropriate resourcesOrder creation and Follow up for supplies and activities :Generate order based on completed information and as per request of patientOrder generation for Sample Packs and documentation Effective communication with distributors and Novo Team Follow up and Confirm the receipt of stock as per orderFixing appointment for Face to face Device demo and other services with patientsFollow up and confirm demo and receipt of other servicesCollecting feedback on the demo and services from patients Ensure follow up for repeat orders and supplies.Compliance :Identify and escalate issues to Kartavya s Project Coordinator in case of any deviation from SOPReport Adverse events and product quality complainsMake sure the patient confidentiality / details are not shared with Novo Nordisk", "companyname": "Kartavya Healtheon Pvt LTd", "location": "Bengaluru / Bangalore,  Mumbai", "experience": "1 - 3 yrs", "salary": "", "type": "", "skills": "Data entry, telecalling, communication skills", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Telemarketing/Telesales Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=xd0y4L__PLUS__ItwpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Blue Tree Global Insurance Brokers Pvt. Ltd.Tele ExecutiveShould have Good Communication Skills and Convincing power.Fluent in English, Kannada and Hindi LanguageShould be able to work with a team.Should have at 1 to 3 years experience in Tele Calling / Tele Sales for Insurance Product, Contacting potential clients (Existing & New) to inform them about product or service.Set appointments with prospective clients.Maintaining records.Ability to learn about products and services and describe/explain them to prospective clients.", "companyname": "Blue Tree Global Insurance Brokers Pvt Ltd", "location": "Bengaluru / Bangalore", "experience": "1 - 3 yrs", "salary": "", "type": "", "skills": "English, Kannada, Hindi, Any other regional language", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Data Entry Operator", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=f6dgKrRKtB9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Insert customer and account data by inputting text based and numerical information from source documents within time limitsCompile , verify accuracy and sort information according to priorities to prepare source data for computer entryReview data for deficiencies or errors , correct any incompatibilities if possible and check outputResearch and obtain further information for incomplete documentsApply data program techniques and proceduresGenerate reports , store completed work in designated locations and perform backup operationsScan documents and print files , when neededKeep information confidentialRespond to queries for information and access relevant filesComply with data integrity and security policiesEnsure proper use of office equipment and address any malfunctionsRequirements :Proven data entry work experience , as a Data entry operatorExperience with MS Office , MS Word , MS Power Point , MS ExcelExcellent knowledge of English , Fluent Communication in EnglishFamiliarity with administrative dutiesExperience using office equipment , like fax machine and scannerTyping speed and accuracyExcellent knowledge of correct spelling , grammar and punctuationAttention to detailConfidentialityOrganization skills , with an ability to stay focused on assigned tasksRequired Education : Any Graduate With Relevant Experience", "companyname": "Spot In Job Consultancy", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Data Entry Operator, Data Entry, MS Office, MS Word, MS Power Point, MS Excel", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Chemical Gold Refinary Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=VGtftaIdz4dzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "In charge for Gold RefineryQualification: Chemical Engg/ DiplomaDesignation: Sr. TechnicianReporting to: Production ExecutiveAge: --26 to 30yrsWork Experience: -- 5-10 Yrs. Having worked in Gold refining area in a reputed firm. Work description:- Responsible for establishing the refining process and ensure that all connected activities are done optimally with a special focus on safety. - Put SOPs for various stages and ensure proper PPEs are in place and used by the operating people. - Required to set work standards, focus on innovative improvements that are necessary to upgrade and ensure the process is of world class standard. - Ensure the purity level as well to ensure all emissions are scrubbed & output gases are not only meeting the PCB norms but are bettering that.- Optimum usage of the refining infrastructure with a clear focus on productivity, gold loss, reducing cost of refining, i.e. cost per gram and inventory control- Train the second in line at par with himself and also develop the skills of the operating personnel to handle day to day workSend CV / Call us to discuss further.Sirisha - HR Executive78999 29106/ 93803 82729Anjum J - HR Executive74838 93596/ 85480 32880DISHA Consulting", "companyname": "DISHA Consulting - Recruitment & Executive Search", "location": "Bengaluru / Bangalore", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "chemical engineer", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "We want Electricial engineer in abroad UAE", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=xvx3V__SLASH__wznDVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Accountant/ computer operator/data entry /cashier Electricial/mechanical/civil eng/supervisor etc.1 - 5 YearsDubaiJob Description Call us - 919899947076Exp - 1 to 5 years experience in Company or Industry AccountantGood Knowledge in Tally Experience Trading Co-PreferablePrepare journal entriesComplete general ledger operationsMonthly closings and preparation of monthly financial statementsReconcile and maintain balance sheet accountsDraw up monthly financial reportsPrepare analysis of accounts as requestedAssist with year end closingsAdminister accounts receivable and accounts payablePrepare tax computations and returnsAssist in preparing budgets and forecastsAssist with payroll administrationMonitor and resolve bank issues including fee anomalies and check differences account/bank reconciliationsReview and process expense reportsSalary: INR 6,50,000 - 7,50,000 PA.Industry: Construction / Engineering / Cement / MetalsFunctional Area: Accounts, Finance, Tax, Company Secretary, AuditRole Category: AccountsRole: Accounts Executive/AccountantKey skillsTally AccountingDesired Candidate ProfilePlease refer to the Job description aboveEducation-12th.graduation etc.Company ProfileALWAYS INTERNATIONAL Jobs,, in Dubai ( U A E ) Call us- IND delhi, +91-9899947076\" ALWAYS Jobs was incorporated in 2017, we are one of the fastest growing HR Service providing companies in India with a national presence through a network of strategic alliances, sourcing professionals to various organizations, enriching their human capital and enabling individuals to optimize their career choices. ALWAYS Jobs is specialized in Recruitment services, Training, People development programs and Temporary work force solutions.\"website-", "companyname": "A.G.R.B. FLY AVIATION PRIVATE LIMITED", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  null", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Administrator, manager admin, Office Equipment, computer operator, data entry, office assistant, accountant, electricial, Mechanical Electrical Engineering", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Jr Wordpress Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=L18os4fJGohzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "You are here:Looking for Jr Wordpress Developer at Rajkot Job For Jr Wordpress Developer in RajkotJob For Jr Wordpress Developer in RajkotReputed IT Company Requires Jr WordPress DeveloperResponsibilities:- gt;Proven software development Knowledge in PHP- gt;Designing and implementing new features and functionality- gt;Establishing and guiding the website s architecture- gt;Designing and implementing new features and functionality- gt;Demonstrable knowledge of web technologies including HTML , CSS , JavaScript , AJAX , etc- gt;Ability to convert comprehensive layout and wireframes into working HTML pages- gt;Ability to understand CSS changes and their ramifications to ensure consistent style across platforms and browsers- gt;Theme Plugins integration- gt;Theme Plugin customization- gt;Custom design integration from PSD / HTML to WordPressRequirement:- gt;Good understanding of front - end technologies , including HTML5 , CSS3 , JavaScript , jQuery , Bootstrap4 , PHP , WordPress- gt;Strong understanding of PHP back - end development- gt;Knowledge of HTML , CSS , Drupal , JavaScript , and related tools / packages- gt;Knowledge of how to interact with Restful APIs and formats (JSON , XML)- gt;Ability to understand CSS changes and their ramifications to ensure consistent style across platforms and browsers- gt;Experience building user interfaces for websites and / or web applications- gt;Experience designing and developing responsive design websites- gt;Opportunity to work on new and challenging technologiesTerms:- gt;1.5 - year bond- gt;2 - month salary as a security purpose- gt;any one educational original certificate submit to the CompanyRequired Education: Any Graduate With Relevant ExperienceRequired Experience: 6 Month to 1.5 YearNo Of Position: 2Location: Kasturba RoadSalary: Upto 15kIndustry: Information TechnologyFunctional Area: DevelopmentDesignation: Jr Wordpress DeveloperJob Type: Full TimeWorking Hours: 10:00 AM To 08:00 AM", "companyname": "Spot In Job Consultancy", "location": "Bengaluru / Bangalore,  Rajkot", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "Drupal, jQuery, XML, Javascript, JSON, Ajax", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Mid Level Wordpress Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=JhI1Hl4ohvRzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "- >Participate in requirements analysis- >Collaborate with internal teams to produce software design and architecture- >Write clean, scalable code using .NET programming languages- >Test and deploy applications and systems- >Revise, update, refactor and debug code- >Develop documentation throughout the software development life cycle (SDLC)- >Serve as an expert on applications and provide technical supportRequirements: - - >Proven experience as a .NET Developer- >Familiarity with the ASP.NET framework, SQL Server and design/architectural patterns (e.g. Model - View - Controller (MVC))- >Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/CSS3- >Familiarity with architecture styles/APIs (REST, RPC)- >Excellent troubleshooting and communication skills- >Experience in DotNet Framework 3.5/4/4.5, MVC 3/4/5, Entity Frameworks- >Good experience in JavaScript/JQuery- >Strong knowledge of SQL and database technologies.Required Education: Any Graduate With Relevant ExperienceRequired Experience: 2 to 4 YearNo Of Position: 1Location: Raiya Telephone ExchangeSalary: Upto 40kIndustry: Information TechnologyFunctional Area: DevelopmentDesignation: Mid Range DotNet DeveloperJob Type: Full TimeWorking Hours: 10:00 AM To 06:00 PM", "companyname": "Spot In Job Consultancy", "location": "Bengaluru / Bangalore,  Rajkot", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "jQuery, Drupal, Wordpress, PHP, Open source, Joomla", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Jr SEO Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=jAOwud5d72hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "You are here:Looking for Jr SEO Executive at Rajkot Job For Jr SEO Executive in RajkotJob For Jr SEO Executive in RajkotReputed IT Company Requires Jr SEO ExecutiveResponsibilities:- gt;Execute tests , collect and analyze data and results , identify trends and insights in order to achieve maximum ROI in paid search campaigns- gt;Track , report , and analyze website analytics and PPC initiatives and campaigns- gt;Manage campaign expenses , staying on budget , estimating monthly costs and reconciling discrepancies.- gt;Optimize copy and landing pages for search engine marketing- gt;Perform ongoing keyword discovery , expansion , and optimization- gt;Research and implement search engine optimization recommendations- gt;Research and analyze competitor advertising links- gt;Develop and implement link building strategy- gt;Work with the development team to ensure SEO best practices are properly implemented on the newly developed code- gt;Work with editorial and marketing teams to drive SEO in content creation and content programming- gt;Recommend changes to website architecture , content , linking and other factors to improve SEO positions for target keywords.Requirements:- gt;Proven SEO experience managing PPC campaigns across Google , Yahoo and Bing.- gt;Solid understanding of performance marketing , conversion , and online customer acquisition- gt;In - depth experience with website analytics tools- gt;Experience with bid management tools- gt;Working knowledge of HTML , CSS , and JavaScript development and constraints- gt;Knowledge of ranking factors and search engine algorithms- gt;Up - to - date with the latest trends and best practices in SEOTerms:- gt; 1.5 - year bond- gt; 2 - month salary as a security purpose- gt;any one educational original certificate submit to the CompanyRequired Education: Any Graduate With Relevant ExperienceRequired Experience: 6 Month to 1.5 YearNo Of Position: 2Location: Kasturba RoadSalary: Upto 15kIndustry: Information TechnologyFunctional Area: Digital MarketingDesignation: Jr SEO ExecutiveJob Type: Full TimeWorking Hours: 10:00 AM To 08:00 AM", "companyname": "Spot In Job Consultancy", "location": "Bengaluru / Bangalore,  Rajkot", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "SEO  executive, Digital marketing, online marketing, Link building, PPC", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Hiring candidate to work and earn from home", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=s6vSWbthWqJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Offering A Part Time homebased work for everyone For Diploma, College Students And House Wife, Graduates and Anyone Can Also Apply.Available Jobs: Internet Ad Posting and Offline.Salary: Up To 10k per Week & Weekly Payment.Need Only 1-2Hours Of Working Per Day And You Can Do It From Your Home or at your free time alsoOnly who are interested can contact usContact at whats appMr.Ravi8929707604Senior Hr", "companyname": "JOY Trip", "location": "Bengaluru / Bangalore,  Chennai,  Delhi,  Kolkata,  Mumbai", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Bpo, Medical Rep, Executive, sales, software engineer, developer, data entry, btech, mba, bcom, bHM, BBA, receptionist, BSC, BA, computer operator, computer hardware engineer", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Urdu Personalized Internet Assessor", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=5HnlEy5COoBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Are you looking for a role that gives you the opportunity to work with one of Americas top 100 most trusted Companies while also increasing your income from the comfort of your home? Then why not join Lionbridge as a part-time Independent Contractor. We are currently recruiting for the role of Personalized Internet Assessor in India.What does the role involve?In this role you will be reviewing online search results in order to improve their content and quality. You will be required to provide feedback and analysis on content found in search engine results and provide ratings on their relevance to the search terms used. Another aspect of this role will involve reviewing the language used in the search results by examining grammar, tone and cultural relevance.Through this work you will be making a valuable contribution by expressing your opinion on the quality and content of what is currently out there on the web. You will play a part in improving the quality of one of the largest search engines in the world using both your PC and required Smartphone device.Who is suitable for this role?We are currently seeking dynamic and creative people who have a strong interest in social media, specifically those who are an active daily user of their Gmail account. We also require suitable candidates to own & use a smartphone Android or iPhone and have a familiarity with other forms of social media and Google products. You should also be flexible, reliable and have the ability to interpret and follow established guidelines.You will have the flexibility and freedom to work from your own home, working your own hours. Hours for this role are a minimum of 10 up to 20 hours per week depending on task availability. We are currently seeking people who have a specific smartphone device (Android V4.2 or higher or iPhone running iOS version 9.0 or higher) to complete tasks. What are the main requirements for the role?You must be fluent in written and verbal English and UrduYou must be living in India for the last 5 consecutive yearsYou must own and use a Smartphone (Android V4.2 or higher or iPhone running iOS version 9.0 or higher) to complete tasksThe majority of the task types will require both a desktop/laptop and a SmartphoneGmail must be your primary email accountActive daily user of Gmail and other forms of social media (Twitter & Facebook)You must have familiarity with current and historical business, media, sport, news, social media and cultural affairs in IndiaAccess to and use of a broadband internet connection and associated computer and software to perform the work, all provided at your own expenseExperience in use of web browsers to navigate and interact with a variety of content Whats next? Don t Delay! Submit your application through the below link using a desktop PC/Laptop:https://goo.gl/oV6HTg A member of our recruitment team will review your application. Please Note: We are unable to offer more than one Personalized Social Media Internet Assessor position per IP address.Only one member per household may apply.", "companyname": "Lionbridge Technologies Pvt Ltd", "location": "Bengaluru / Bangalore,  Delhi,  Delhi/NCR,  Hyderabad/Secunderabad,  Lucknow", "experience": "1 - 5 yrs", "salary": "", "type": "", "skills": "Urdu, English Language, Internet, Web surfing, Smartphone, Android, iPhone, web Browser, Internet Search, online content", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Mid Level UI/UX designer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=3RNOw3SPm__SLASH__xzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Reputed IT Company Requires Mid Level UI- UX DesignerResponsibilities:- Gather and evaluate user requirements in collaboration with product managers and engineers- Illustrate design ideas using storyboards, process flows and sitemaps- Design graphic user interface elements, like menus, tabs, and widgets- Build page navigation buttons and search fields- Develop UI mockups and prototypes that clearly illustrate how sites function and look like Create original graphic designs (e.g. images, sketches, and tables)- Prepare and present rough drafts to internal teams and key stakeholders- Identify and troubleshoot UX problems (e.g. responsiveness)- Conduct layout adjustments based on user feedback- Adhere to style standards on fonts, colors, and images- plan and implement new designs- Optimize existing user interface designs- Communicate with clients to understand their business goals and objectives- Develop technical and business requirements and always strive to deliver intuitive and user- centered solutions- Combine creativity with an awareness of the design elements- Create prototypes for new product ideas- Test new ideas before implementing- Conduct ongoing user researchRequirements:- Proven work experience as a UI/ UX Designer- Portfolio of design projects- Knowledge of wireframe tools (e.g. Wireframe.cc and InVision)- Up- to- date knowledge of design software like Adobe Illustrator and Photoshop- Team spirit; strong communication skills to collaborate with various stakeholders- Good time- management skillsTerms:- 1.5- year bond- 2- month salary as a security purpose- Any one educational original certificate submit to the CompanyNo Of Position: Working Hours: 10:00 AM To 08:00 AM", "companyname": "Spot In Job Consultancy", "location": "Bengaluru / Bangalore,  Rajkot", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "user interface", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "home based work for all,Imternet marketing,online ad posting", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=6ftwxJ0SWXdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Dear All,Work profile : To promote tourism on various website by copy the data and paste on website and forward the queries to company.All Can Earn working at Home Using YourComputer , mobiles having Internet, Our Company Offers You Genuine Online ad posting promoteStudents, Fresher s And WorkingProfessionals Basic Computer Knowledge Needed , NoExperience, no target in ad posting .weekly income.Contact at whats appMr.Ravi8929707604Senior Hr", "companyname": "JOY Trip", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Bpo, Medical Rep, Executive, sales, software engineer, developer, data entry, btech, mba, bcom, bHM, BBA, BSC, BA, computer operator, Housewives, Engineer, IT, Air hostess", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Chief Agency Business Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=EiUiYfApKxlzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Dear Candidates,We are looking candidates who are interested to make career in Life Insurance and Recruits and Manages the OnRole advisors a team, Job descriptionTo Recruit advisorsand make train, support them to sell Insurance. Can recruit any number of agents with them. Agents will be given Commission.Company will provide fixed salary + Commitions + Incentives to all AdvisorsRequired Candidate profileCandidates who are agents and have two years experience in Insurance/ BFSI/ NBFC/ Mutual Fund/ Share broking companies who faced loss in their business - People who are associated with Finance - Candidates who have gap can apply. Plus two {12th} is the minimum required qualification.Kindly feel free to call me on Prajakta- 9960670640Sameer- 9665960020", "companyname": "STEPUPFIND", "location": "Bengaluru / Bangalore,  Kolkata,  Jammu,  Mumbai,  Navi Mumbai", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Insurance, LI, Life Insurance, Agent, OnRole Team, Advisor", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "MNC BPO Hiring For Freshers / 3.5 LPA / 5 Days Working / Cab", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=xoYMmQyMW__PLUS__xzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job - Customer Care OfficerEmployment in on Phonepe payrollFresher Salary - 3.5 LPAExperienced Salary - upto 6 LPAFive Days workingOne side cab in odd hoursShift Time 08 am to 1amRequired Candidate profileCandidate should be Graduate. No backlogs.Excellent communication skillsWillingness to provide great customer serviceImmediate Joiners", "companyname": "Laxmi Infotech", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "bpo, Customer, kpo, Call Center, Customer Care, business analyst, business associate, Medical Rep, fresher, computer operator, data entry", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Business Development Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=N8__PLUS__rW5UekWdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "WORK FROM HOMEJob Description:Online Bidding for New Businesses in IT, ITES, ERP domains from online portals like Upwork, GURU, PPH, Fiverr etc.Lead Generation, Designing and Development of Business Proposals with prospective clientsProspect for potential new clients and turn them in opportunitiesSend out Information kit to prospective customer giving information about Company service offerings - IT services/Web ServicesGenerate Business from the market. Identifying sales opportunities through extensive market researchBuilding and maintaining strong relationship with all potential and existing clientsNew Customer acquisition activities like Cold-calling, lead generation, meeting prospects, submitting business proposals.Following the sales process from start to close. Eager to expand company with new sales, clients & territoriesDevelop and execute strategic plans to achieve sales targets and expand our client baseArranging Business meetings and one-on-one conversation with prospective clientsPrepare PowerPoint presentations and address target audience by inspiring sales speechSound Communication, Presentation and Interpersonal SkillsManaging end-to-end client relationship including pitching, negotiationParticipate in the performance appraisal process for personal and organizational growth", "companyname": "Multi fold IT Solutions private limited", "location": "Bengaluru / Bangalore,  Delhi/NCR,  Hyderabad/Secunderabad,  Kolkata,  Jalandhar", "experience": "1 - 3 yrs", "salary": "", "type": "", "skills": "Data Mining, data analyst, online bidder, digital sales, digital marketing, website sales, lead generator, business development, Client Handling", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "AREA SALES MANAGER (AYURVEDIC)", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=p02EsS4d__PLUS__UxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Required a AREA SALES MANAGERfor Well Established AYURVEDIC/ETHICAL Company MORVIN INDIA HEALTH CARE PVT. LTD Visiting doctors and pharmacists on a daily basis. Offering, Promoting and presenting of pharmaceutical products. Building positive and professional relations with clients and tracking of market trends.Constant analysis of new market methodResponsibilities and Duties1)Build and maintain client relationship.2) Contribute to product development. Analyze customer feedback and collaborate with the tech and operation team to improve the product.3) Excellent communication skills. You enjoy talking to clients, understanding their problems, and closing deals.", "companyname": "Morvin India", "location": "Bengaluru / Bangalore,  Chennai,  Other City(s) in Arunachal Pradesh,  Guwahati,  Other City(s) in Kerala", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "MARKETING", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "\"Domestic IT Recruiter\"", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=BY5r5R2egs9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Position: IT Recruiter (domestic)Location: Work from HomeRemuneration:Fixed CTC + incentive per hire on % basis.Max. budget 16K per month fixed CTC but for a deserving candidate.Finalized CTC offered will vary upon candidate's performance in the Interview. (there will be 2 rounds of telephonic interview)Mandates:This is purely Work from HomeLooking for female candidates ONLY.Candidate shall have her own laptop/PCNo reimbursements for data/voice/ laptop etc.Fluent in HindiEligibilityWomen with recruitment experience but break in their careers looking to join the work force are welcome.Applying candidates shall be familiar with Boolean Search.**This job is \"Work from Home\" but requires same dedication and diligence from the recruiter as in case of a Corporate job profile.**Working Days: 5 days a week + Odd Saturdays workingThe profile involves cold calling the prospective candidates (it is a mandate), ppl having reservations with regards to the same, need not apply.Responsibilities:Applying boolean search in job portals (such as naukri etc.) and leveraging social media platforms (linkedin, facebook etc.), sifting profiles.Cold Calling and conducting preliminary interviews by making telephonic calls to the prospective candidates to inquire about their interest.Telephonic Screening of the profiles checking for Technical Fit/ suited in compliance to the Clients job description.Developing & maintaining candidate MIS database and trackers in line with the provided format.Scheduling of Interviews of the candidates in close co-ordination with client HR.Ensuring proper co-ordination between Client(s) and Candidates. Desired Skills:Looking for a full-time work from home, recruiter with 1+ years and above experience into recruitment.Experience of Middle level, Sr. Level hiring.Should have experience in working on job portals using simple and boolean search methods.Can leverage social media platforms for hiring. If not, should have zeal to learn and implement.Good communication skills & good skill set of Telephonic Screening.Balancing both Professional & Personal work.Should have good exposure to hiring the right talent through job portals, social media, references etc.Graduate in any discipline or equivalent.Contact:Pls mail us your resume with expected CTC and notice period to join details", "companyname": "Job Jeanie Consultants", "location": "Bengaluru / Bangalore,  Delhi/NCR,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "2 - 5 yrs", "salary": "", "type": "", "skills": "Recruiting, Cold Calling", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Coding Analyst,Software Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=XLKvr4ycQdxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "This is backend back office roleGraduate with Excellent English Communications can applyJob Role - Associate - Data CodingDomain is Market ResearchCandidate should be good in excelRotational shiftsRequired Candidate profileGraduate with Good English Communication skillsCandidate should know MS ExcelJob Role - Associate Coding in Market Research Domain", "companyname": "Laxmi Infotech", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "1 - 5 yrs", "salary": "", "type": "", "skills": "fresher, mba, B.com, Tally, Accountant, accounts executive, java, c ++, Html, oracle, Erp, embedded, Mainframe Cobol, .net, qa", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Be B Tech Fresher", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=deINnPr__PLUS__QUpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Liaise with various business functions & technical functions for the below points :a. Internal Customer Management, b. Software Development Life Cycle, c. Budget Management, d. Business Process Management, e. Vendor Management f. UAT g. Support applicationsLiaise with IT Compliance and Information Security teams as and when requiredPlay an active role in Project Implementation / Roll-outs as a Business Analyst / Project ManagerAutomation:RPA/RTA AutomationsDesign, develop and deploy Robotics Process Automation (RPA) solutions using different tools, design principles and conventionsConfigure robotics processes and objects using core workflow principles in an efficient way; ensure they are easily maintainable and easy to understandUnderstand existing processes and facilitate change requirements as part of a structured change control processSolve day to day issues arising while running robotics processes and provide timely resolutions", "companyname": "Laxmi Infotech", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Erp, Crm, consultant, project manager, software engineer, software developer, php developer, web developer, ui developer", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Home Based Work For All Freshers,housewives,@students", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Fb3iI1hTma5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "The Tour Vacations : Company is an ISO Certified tourism based company need candidates for part time /work from home who spend 2-3 hrs daily and earn weekly.No Target and no time boundationFeel free to contact at whats appRequired Candidate profileRequired things are :1. Laptop/ Smartphone are required work from home2. If not available you can work from office3. basic internet knowledge.4. Must be 18 years old5. Graduates are preferable.6. Good English or Hindi speaking", "companyname": "Laxmi Infotech", "location": "Bengaluru / Bangalore,  Chennai,  Delhi,  Hyderabad/Secunderabad,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "bca, Mca, B.sc, msc, be, btech, fresher, trainee, data entry, system administrator, technical support engineer, system engineer, desktop engineer, engineer", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Java Developer, Java J2Ee Developer, Java Fresher", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=UTsenutg5e5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We have immediate requirement of Java developer with our clients. If interested apply on naukri. Don't call we will get back to if shortlisted.Required Candidate profileImmediate Joiners, Address : QuickXpert Infotech, 903, Ganesh Tower, opp platform 2 Thane w rly stn, besides Rickshaw stand", "companyname": "Laxmi Infotech", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "java, c ++, Html, Css, Javascript, Asp.net, j2ee, Struts, Jsp, Jdbc, Ejb, Jms, Hibernate, Jsf, Spring", "startdate": "", "enddate": "Jul 20, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Civil Engineer,Site Supervisor", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=b1NaTFrXxrFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Civil Engineer Very Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Construction Civil Engineering, Civil Engineer, site engineer, site coordinator, site consultant, site supervisor", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Mainframe Programmer,Mainframe Programmer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ne__SLASH__LZZ6nwOFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Mainframe Developer,Mainframe ProgrammerVery Urgent Requirement If Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Mainframe Developer, Mainframe Programmer, Cobol, Cics, Mvs, Db2, Mainframe - zOS System Programmer, Ibm Mainframe, Mainframes", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "BPO Executive, BPO Analyst, BPO Trainee", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=vJO0Ny0l2DpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Hiring for almost all the international BPO's in Pune. Come and grab the opportuinity to work in an elite organization and help the Clients based in UK, USA, Australia & New Zeland.Attractive Salaries + IncentivesCab Services5 Days working 2 days offRotational ShiftsBonuses based on PERFORMANCE", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Mumbai,  Noida/Greater Noida,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Back Office Operations, Back Office Support, Customer Interaction, bpo, Kpo, Call Center, Customer Service, BPO Executive, BPO Analyst, BPO Trainee", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Computer Operator/Data Entry Operator", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=msneMB66CElzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Roles & Responsibilities: Position:Fresher /Computer Operator/ Data Entry Executive/Online Data Entry / Data Entry Operator / Data Base Administrator / Data Entry Officer/DEo/Back Office Executive/ Data Entry ExecutiveFreshers can also ApplyAny Graduate/Post GraduateCandidate can work from Any Location.Form Filling and Ad posting kind of requirements.Online Data Entry and Form Filling JobsYou need to work for various fortune 500 listed companies.2 hrs a day. You can work from home by doing your current activities like job, business or collageVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Aryan Technology 204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Mobile - 9890601688", "companyname": "Aryan technologies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Fresher, Online Data Entry, Data Entry Operator, Data Base Administrator, Data Entry Officer, Form Filling, Computer Operator, Data Entry Executive, DEO, Data Entry", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Database Administrator, Oracle Database Administrator, DBA", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=0q3QlmGY5ExzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Database Administrator, Oracle Database Administrator, DBAVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, Tilak Road, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Oracle Apps Dba, Oracle Apps, Oracle Reports, Oracle Workflow, Database Administrator, Oracle Database Administrator, DBA, Sql", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "SAP, SAP Manager, SAP Consultant, SAP Abap, SAP Basis", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=mfv1cXHdQHBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:SAP, SAP Manager, SAP Consultant, SAP Abap, SAP Basis, SAP CRMVery Urgent Requirement If Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "SAP, SAP Manager, SAP Consultant, SAP Abap, SAP Basis, SAP CRM, Sap Crm Sales, Sap Crm Marketing, Erp, Sap", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Quality Analyst,Assistant Quality Manager,Quality Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Jw7gWRWNuqFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Quality ManagerVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Quality Manager, manager, Quality Analysis, Quality Monitoring, Quality Audit", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Supervisor, Administration Manager, Office Manage", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=tbw__SLASH__NiPriFNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Supervisor, Administration Manager, Office ManageVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Supervisor, Administration Manager, Office Manage, Site Supervision, site supervisor, admin maneger, manager, assistant manager, assistant manager operations", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Production Supervisor, Production Manager, Production Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ClLC4mbw5dRzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Production Supervisor, Production Manager, Production ExecutiveVery Urgent Requirement If Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Production Supervisor, Production Manager, Production Executive, production officer, production incharge, production engineer", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Electrical Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=h6JUKCtxzChzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Electrical EngineerVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "graduate, electrical engineering, thermal engineering, diploma, iti", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Work From Home 5 Computer Based & Handwriting Jobs @ 9748378O25", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=legPFxbZgPNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "MINANASHIKAa company registered under Ministry of Corporate Affairs- Government of Indiaand having ISO, IAF, MSME, SSL Certificatesand TAN& PAN Cardin company's name, is hiring serious Data Entry Operators who work from home.Candidates must have their Laptop / Desktop at home. Candidates must have good knowledge of MS-Office like Word, Excel and Internet.We have professional mail idfor providing jobs details & Offer letter. We don't use Gmail id.Call / Whats-appour HR @ 9748378025to apply for the post (Only serious candidates) Job DetailsPost :Data Entry OperatorJob Type : Work from Home / Full Time / Contractual JobVacancy : 20Skill :MS Word, MS Excel & InternetTyping Speed : 20 wpm to 30 wpmWorking Hours :Minimum 6 hrs. to 8 hrs. at homeWork Type : Offline work but internet is req. for transferring data to us.Interview : TelephonicTest :Typing Speed & AccuracyJob Training :Online (Only for selected candidates)Projects to be worked on :1) Medical Content Writing2) Data Entry in Excel sheet3) Manual Writing Project4) USA EDU Survey Project5) Digital Parts Form Filling6) Data ProcessingCall / Whats-app HR @ 9748378025to apply for the post (Only serious candidates) For Details Visit our Websites : mshiss.co mNote :We don't claim that the job is very easy and it can be done by anyone spending only 2 hrs. to 3 hrs. daily with great income.We don't have any short cut high income policy.Beware: Some Companies and group of people are posting ads showing our company's project (Job) Demo or image like Excel Numeric, Manual Form Filling etc and using their whatsup no. for chatting for scamming people.Contact us for getting list of scam people and companies.", "companyname": "Manthan Solutions", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Thiruvananthapuram,  Coimbatore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Part time, Freelance, Work From Home, MS Office, Typing, BPO, HR, Home Based, Computer Data Entry, Computer Typing, Computer based Job, Data Typing, Back Office, Data Entry", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Data Entry Jobs", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=QzdYJzG2iBpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Roles & Responsibilities: Position:Fresher /Computer Operator/ Data Entry Executive/Online Data Entry / Data Entry Operator / Data Base Administrator / Data Entry Officer/DEo/Back Office Executive/ Data Entry ExecutiveFreshers can also ApplyAny Graduate/Post GraduateCandidate can work from Any Location.Form Filling and Ad posting kind of requirements.Online Data Entry and Form Filling JobsYou need to work for various fortune 500 listed companies.2 hrs a day. You can work from home by doing your current activities like job, business or collageVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Aryan Technology 204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Mobile - 9890601688", "companyname": "Aryan technologies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Fresher, Online Data Entry, Data Entry Operator, Data Base Administrator, Data Entry Officer, Form Filling, Computer Operator, Data Entry Executive, DEO, Data Entry", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Android Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=8mCvmXFSFINzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "1.Basic fundamental of Android developing should be clear2.Excellent knowledge in Java. And OOPS.3.Strong knowledge of Android Studio.4.Work on any chat application5.Should have knowledge of XMPP Protocol (preferable)6.Good Knowledge of Android SDK's (NDK is plus point), different versions of Android, and how to deal with different screen s.7.Strong innovations skill in android design and development.8.Strong knowledge of Android UI design principles, patterns, and best practices in Material Design.9.Familiarity with Restful APIs to connect Android applications to back-end services.10. JSON and XML parsing.11. Experience with third-party libraries and APIs.12. Experience of Google's APIs like Locations and Map APIs13. Solid understanding of the full mobile development life cycle.", "companyname": "Villa Software solutions", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Mumbai,  Noida/Greater Noida,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Android Sdk, Android Studio, Xml, Asp.net, oops, Jquery, Javascript, Html, Css, json, Ajax, android, Android Development, Mobile Applications, Ios Development, Sqlite", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "HR Manager, HR Recruiter, Recruitment Executive, HR Trainee", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=UYYflmpjVS1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:HR Manager, HR Recruiter, Recruitment Executive, HR TraineeVery Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "HR Manager, HR Recruiter, Recruitment Executive, HR Trainee, Human Resourcs, Recruitment, hr executive, human resource, assistant hr", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Design Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=yExfA6KrvShzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:We are hiring for Design EngineerVery Urgent Requirement If Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Sheet Metal, 3d Modeling, Solid Modeling, Assembling, Metal Fabrication, Piping, Assembly, Assembly Language", "startdate": "", "enddate": "Jul 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Banking operations", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=LLHUM1ozMjBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Any graduate with experience in Banking/Finance/ Accounts Process can Walkin. Excellent communication skill is required . Ready to work in Any shifts.Qualification:- Any Commerce/ Management Graduate with 0 yr to 4 yrs of experience can Walk In. Reconciliation Experience will be an added advantage. BE / B Tech / MCA / Ms IT / BCA / M Sc also eligible. MBA with 0 to 3 yrs can apply. CA / ICWA inter candidates with F&A experience can apply.Required skill set: Excellent communication skills both verbal and written . Excellent MS Excel and power point skills . Good Analytical thinking.; Good knowledge in accounting concepts . Should have Good Communication skill. Ready to work in Any shifts.", "companyname": "Villa Software solutions", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "banking, finance, accounts, customer service executive, Business Analysis, insurance executive, Office-mgmt, Sales, accountant, relationship manager, key accounts", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Executive Accounts and Finance, Tax, CS,Audit", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=IAbmJTMIhzxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Accounts, MIS, VAT, CST, Payroll software, PF, ESI, PT, Labour laws, Service Tax, Income Tax, TDS, Excise , Imports, Interview Skills.With all these you'll be in a position to design CTC, Gross Salary breakup in regard to minimum wages act, Income tax exemptions & labour acts. We'll give indepth knowledge on all the areas of PF, ESI, PT Payroll Income Tax, TDS & Tax Planning", "companyname": "Villa Software solutions", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Kolkata,  Mumbai", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Accounts, Finance, Tax, CS, Audit, B.com fresher, MBA Fresher, Tax Consult, Cost Accountant, finance Tally, MIS, VAT, CST, Payroll, Service Tax, Income Tax, TDS", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Civil engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=JZPbi8Fc1oVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Civil engineers perform some or all of the following duties: Confer with clients and other members of the engineering team and conduct research to determine project requirements Plan and design major civil projects such as buildings, roads, bridges, dams, water and waste management systems and structural steel fabrications Develop construction specifications and procedures Evaluate and recommend appropriate building and construction materials Interpret, review and approve survey and civil design work Conduct field services for civil works Ensure construction plans meet guidelines and specifications of building codes and other regulations Establish and monitor construction work schedules Conduct feasibility studies, economic analyses, municipal and regional traffic studies, environmental impact studies or other investigations Monitor air, water and soil quality and develop procedures to clean up contaminated sites Conduct technical analyses of survey and field data for development of topographic, soil, hydrological or other information and prepare reports Act as project or site supervisor for land survey or construction work Prepare contract documents and review and evaluate tenders for construction projects Supervise technicians, technologists and other engineers and review and approve designs, calculations and cost estimates.", "companyname": "Villa Software solutions", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai,  Noida/Greater Noida", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Building Construction, Civil Design, Roads, Site Supervision, Bridges, Civil Works, Construction Projects, Planning, Dams, Survey", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Fresher Java, Android, IOS Developer in pune", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=LVuML__SLASH__3GS3ZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:We are hiring for Fresher Java, Android, IOS Developer in puneCandidate Profile:Candidate should be B.E./ B Tech./ B.C.A./ M.C.A./M.C.M. Very Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, Tilak Road, Pune - 411 030.", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Kolkata,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Android Sdk, Android, java, ios, core java, Advanced Java J2EE", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Software Engineer,Fresher .Net Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=9wyb__SLASH__U7eSmJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Fresher .Net DeveloperSoftware Development - Knowledge of .NET,ASP .Net or VB .Net or C# .Net or ASP or HTML or JavaScript or CSS or Database is preferred.Candidate Profile:Candidate should be B.E./ B Tech./ B.C.A./ M.C.A./M.C.M.Very Urgent Requirement If Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, TilakRoad, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "ASP .net c#, ASP .net Web Development, ASP Programming, ASP JScript, ASP Scripting, Asp.net", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}, {"title": "Manual Testing,Test Engineer,Fresher Software Test Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=F__SLASH__EDGEQ7SXVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description:Fresher Software Test Engineer, Software Tester, Software TestingCandidate Profile:Candidate should be B.E./ B Tech./ B.C.A./ M.C.A./M.C.M. Very Urgent RequirementIf Your Profile Matches The Above Requirement And If You're Interested In The Above Opening Kindly Email Your Resume At The Earliest As Word Doc Attachment Without Changing The Subject Line.Register on aryantech website for interview appontmentAryanTech India Pvt Ltd204, 2nd Flr, Pinnacle Pride, Sadashiv Peth,Above Maharashtra Electronics, Nr Durvankur Dining Hall, Tilak Road, Pune - 411 030.Send your CV through email", "companyname": "Aryan technologies", "location": "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "test eng, manual testing, Automated Test Tools, Automated Testing", "startdate": "", "enddate": "Jul 21, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1590157189.753911}]