[{"title": "Billing Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=U__PLUS__6wj1GYlrZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job brief:We are looking for a competent Billing specialist to undertake a variety of financial and non-financial tasks in order to help guarantee the companys revenues. You will handle the processing of incoming payments along with the issuing of necessary paperwork.Responsibilities:Assume the responsibility of receiving and sorting incoming payments with attention to credibilityManage the status of accounts and balances and identify inconsistenciesIssue and post bills, receipts and invoicesCheck the validity of debit accountsUpdate accounts receivable database with new accounts or missed paymentsEnsure all clients remain informed on their outstanding debts and deadlinesProvide solutions to any relative problems of clientsWrite thorough reports on billing activity with clear and reliable dataRequirements:Proven experience as Billing SpecialistAdherence to laws and best practices in regards to dealing with customers and dataComfortable dealing with numbers and the processing of financial informationExcellent knowledge of MS Office (particularly Excel) and ER software (JDE or other)Proficiency in EnglishResults-driven and patientHigh degree of attention to detail and trustworthinessBSc degree in Finance, Accounting or BA", "companyname": "Gajanan Bobade Pundlikrao", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Kolkata", "experience": "4 - 9 yrs", "salary": "", "type": "", "skills": "Business Requirements, Clients, Billing, Cash, Balance Sheet, Balance Sheets, Accounting, Financial Accounting, Management Accounting, Marketing Management", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Billing Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=eSKDvorcR3ZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job brief:We are looking for a competent Billing specialist to undertake a variety of financial and non-financial tasks in order to help guarantee the companys revenues. You will handle the processing of incoming payments along with the issuing of necessary paperwork.Responsibilities:Assume the responsibility of receiving and sorting incoming payments with attention to credibilityManage the status of accounts and balances and identify inconsistenciesIssue and post bills, receipts and invoicesCheck the validity of debit accountsUpdate accounts receivable database with new accounts or missed paymentsEnsure all clients remain informed on their outstanding debts and deadlinesProvide solutions to any relative problems of clientsWrite thorough reports on billing activity with clear and reliable dataRequirements:Proven experience as Billing SpecialistAdherence to laws and best practices in regards to dealing with customers and dataComfortable dealing with numbers and the processing of financial informationExcellent knowledge of MS Office (particularly Excel) and ER software (JDE or other)Proficiency in EnglishResults-driven and patientHigh degree of attention to detail and trustworthinessBSc degree in Finance, Accounting or BA", "companyname": "Gajanan Bobade Pundlikrao", "location": "Belgaum,  Bellary,  Bengaluru / Bangalore,  Bidar,  Davanagere", "experience": "4 - 9 yrs", "salary": "", "type": "", "skills": "Billing Systems, Billing, Invoice, Sales Order, Purchase Order, Purchasing", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Data Scientist - Machine Learning,Remote,Sr. Associate,Associate", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=9__SLASH__CwPlLDGTJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We are looking for a Machine Learning Engineer/Data Scientist to work alongside our innovative and growing data science team.The role will be will be primarily Work From Home (WFH)till Dec'20 due to Covid-19 situation. Thereafter, candiates can be aligned to Gurgaon & Bangalore office, and WFH depending on the projects and clients' requirements.Job description Our Data Analysts are expected to explore data, technologies, and the application of mathematical techniques to derive data insights. Ability to gather the domain specific knowledge of the data. Should have good quantitative skills and the ability to tell a story using data. Ability to build and fine tune machine learning algorithms which are first used at a proof-of-concept stage and then at a production level. Should be able to translate prototypes into new products, and provide guidelines for large-scale implementation.", "companyname": "AINEAI Private Limited", "location": "Bengaluru / Bangalore,  Delhi/NCR,  Hyderabad/Secunderabad,  Mumbai,  Pune", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Data Science, Python, Machine Learning, Natural Language Processing, Statistical Analysis, Predictive Modelling, R, Machine Learning Engineer", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Business Development,Business Development Manager,Remote - India", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__PLUS__ufeUwbJZU1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We are looking for a Business Development Specialist for our software and apps products and services.The role involves selling the product to medium and large d businesses across verticals.The role involves :- Complete responsibility of the sales pipeline - from lead gen to closure Liaise with prospects, explain/demo the product, and follow up where requiredShare customer inputs with the product teamJob Perks :- Competitive pay, Great work-matesWe also offer medical insurance, flexible timings, work from home,free meals and Uber credits.We work on trust and mutual respect.", "companyname": "AINEAI Private Limited", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Hyderabad/Secunderabad", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Business Development Marketing, Business Development Client Servicing, Business Development IT, Corporate Sale Corporate Marketing, Application Sales, sales manager", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Lady Teacher-English", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=TWofIjinL9lzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Developed English lesson plans in line with the national curriculum: Planned English lessons to meet curriculum standards.Helped students understand, speak, read and write in English.Delivered engaging, coherent lectures and motivating lessons to students across all Key Stages. Utilized learning technology in the planning and delivery of lessons.Modified assignments and activities to meet the learning needs of individual students Identified and sorted into small, similarly skilled groups.Classroom management: Prepared English classroom and coursework materials, homework assignments, and handouts. Prepared course work, planned class sessions: Selected/integrated appropriate instructional materials for classroom instruction Organized/delivered classroom lectures to students. Arranged extra-curricular activities and set targets for pupils.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Teacher-English, Teaching, Faculty, Academic Teaching, Student Handling", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Transport in Charge", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=9RRlSMN8YyZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Direct activities related to dispatching, routing, and tracking transportation vehicles, such as aircraft and railroad cars.Plan, organize and manage the work of subordinate staff to ensure that the work is accomplished in a manner consistent with organizational requirements. Direct investigations to verify and resolve customer or shipper complaints.Serve as contact persons for all workers within assigned territories.Implement schedule and policy changes.Collaborate with other managers and staff members in order to formulate and implement policies, procedures, goals, and objectives.Monitor operations to ensure that staff members comply with administrative policies and procedures, safety rules, union contracts, and government regulations.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 4 yrs", "salary": "", "type": "", "skills": "Transport Incharge, Transport Coordinator, Transport Management, Distribution", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Full Stack Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Sk8baxyOgCtzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Define and implement database, SQL standards and best practices.Execute all changes of db schema and maintain controlled development database environment.Work closely with application developers to test, configure, and optimize servers based on application demands; work with large volume, heavy load databases.Conduct Code Reviews to ensure coding standards, best practices and avoid potential performance issues.Create database scripts for all objects and integrate them with source control.Handle database object deployment to Integration, QA, UAT, and Production.Diagnose and resolve development database issues.Expert level skills in reading and writing complex stored procedures, views, and triggers.Excellent debugging and problem solving skills.Experience writing technical documentation.Good in SQL, Shell scripts, Unix commands, MySQL, Oracle, ...", "companyname": "Times of India Ascent", "location": "Bengaluru / Bangalore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Full Stack Developer, Application Development, Sql", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Registrar in Critical care", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Int__PLUS__qNHi38ZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Handles the tasks of controlling communicable disease in the assigned territoryAccess environmental health concerns with the help of stakeholdersResponsible for developing, implementing and recommending policies in support of improved healthPerforms tasks of educating health care providersPlans as well as evaluates health care programsMonitor and supervise heath surveillance activities and programsProvides leadership in case of emergency situations", "companyname": "Times of India Ascent", "location": "Bengaluru / Bangalore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Registrar in Critical care, Medical Officer, Patient Care, IDCCM Fellowship", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Resident Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=8vYg3CCqXxBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Prepares asset, liability, and capital account entries by compiling and analyzing account information.Documents financial transactions by entering account information.Recommends financial actions by analyzing accounting options.Summarizes current financial status by collecting information; preparing balance sheet, profit and loss statement, and other reports.Substantiates financial transactions by auditing documents.Maintains accounting controls by preparing and recommending policies and procedures.Guides accounting clerical staff by coordinating activities and answering questions.Reconciles financial discrepancies by collecting and analyzing account information.Secures financial information by completing data base backups.Maintains financial security by following internal controls.Prepares payments by verifying documentation, and requesting disbursements.Answers accounting procedure questions by researching and interpreting accounting policy and regulations.Complies with federal, state, and local financial legal requirements by studying existing and new legislation, enforcing adherence to requirements, and advising management on needed actions.", "companyname": "Times of India Ascent", "location": "Bengaluru / Bangalore", "experience": "2 - 3 yrs", "salary": "", "type": "", "skills": "Accountant, Audit, Tally, ERP, Taxations", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Senior Manager System", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=8tQ2QNRbErdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Achieves operational objectives by contributing information and recommendations to strategic plans and reviews; preparing and completing action plans; implementing production, productivity, quality, and customer-service standards; resolving problems; completing audits; identifying trends; determining system improvements; implementing change.Meets financial objectives by forecasting requirements; preparing an annual budget; scheduling expenditures; analyzing variances; initiating corrective actions.Updates job knowledge by participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.Enhances department and organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Senior Manager, Operation Management, Facilities management", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Senior Officer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=2DsuUdxnBJZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Prepares asset, liability, and capital account entries by compiling and analyzing account information.Documents financial transactions by entering account information.Recommends financial actions by analyzing accounting options.Summarizes current financial status by collecting information; preparing balance sheet, profit and loss statement, and other reports.Substantiates financial transactions by auditing documents.Maintains accounting controls by preparing and recommending policies and procedures.Guides accounting clerical staff by coordinating activities and answering questions.Reconciles financial discrepancies by collecting and analyzing account information.Secures financial information by completing data base backups.Maintains financial security by following internal controls.Prepares payments by verifying documentation, and requesting disbursements.Answers accounting procedure questions by researching and interpreting accounting policy and regulations.Complies with federal, state, and local financial legal requirements by studying existing and new legislation, enforcing adherence to requirements, and advising management on needed actions.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Mutual Fund Advisor, Mutual Fund Management, Credit Control & Collections", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Designer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=gY8lGlRZxTJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Plans concept by studying information and materials.Illustrates concept by designing rough layout of art and copy regarding arrangement, , type and style, and related aesthetic concepts.Obtains approval of concept by submitting rough layout for approval.Prepares finished copy and art by operating typesetting, printing, and similar equipment; purchasing from vendors.Prepares final layout by marking and pasting up finished copy and art.Ensures operation of equipment by completing preventive maintenance requirements; following manufacturer's instructions; troubleshooting malfunctions; calling for repairs; maintaining equipment inventories; evaluating new equipment.Completes projects by coordinating with outside agencies, art services, printers, etc.Maintains technical knowledge by attending design workshops; reviewing professional publications; participating in professional societies.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Designer, Graphic Design, Photoshop", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "IT Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=SCLyw8UlPtBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Produce weekly reports of outstanding issues and projects.Review and approve new drafts and changes to policies and procedures. Maintain current standards, policies, and procedures for all new and existing equipments.Develop and maintain comprehensive documentation for multiple environments.Write scripts to automate common operational tasks.Provide support for 24x7 customer-facing networks (shared responsibility).Strong knowledge of network services and web application infrastructures in a Management of network access control systems including host-based firewalls (primarily ipfw) and Cisco network equipment.Experience with Disaster Recovery (backup, recovery, archiving, antivirus).Experience with Security Incident Response.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "IT Executive, System Admin, Technical Support, Maintenance, Repairing, Troubleshooting", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "H.R Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=EyE2LpcHx__SLASH__RzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Bridge management and employee relations by addressing demands, grievances or other issuesManage the recruitment and selection processSupport current and future business needs through the development, engagement, motivation and preservation of human capitalDevelop and monitor overall HR strategies, systems, tactics and procedures across the organizationNurture a positive working environmentOversee and manage a performance appraisal system that drives high performanceMaintain pay plan and benefits programAssess training needs to apply and monitor training programsReport to management and provide decision support through HR metrics", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "H.R Manager, Recruitment, Performance Management, Employee Relations", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "MIS Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=j3h5u__PLUS__X234BzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Maintaining MIS of Data CollationCompilation Analysis Data & provide data for Sales forecast. Making short & smart overview on to vast data. Preparing the daily MIS reports of all the departments. Should be able to handle Ad-hoc of management independently Managing common mail box of CPC", "companyname": "AINEAI Private Limited", "location": "Bengaluru / Bangalore,  Delhi/NCR,  Hyderabad/Secunderabad", "experience": "0 - 2 yrs", "salary": "", "type": "", "skills": "MIS, mis executive, mis analyst, MIS Report, MIS Forecasting, Management Information System, MIS Costing, MIS Budgeting, MIS Auditing", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "\"Urgent Hiring Of Sales Person For Healthcare Products\"", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=JMDlEJrJQ4VzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We are hiring of sales person for Healthcare Products.The ideal candidate should be sales driven who can generate leads through online sources (Alibaba/Indiamart), engage with customers, show samples, close transaction, undertake invoicing and manage logistics.Two wheeler a must since there will be lot of travel within the city of Bangalore.Responsibilities:Post products online and generate leadsAttend to calls (including International) and focus on salesService the clients and manage invoicing and logistics/delivery", "companyname": "NUMAME EXIM PRIVATE LIMITED", "location": "Bengaluru / Bangalore", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Invoicing, Logistics Management, Lead Generation, Knowledge of computers, excel, e-commerce, Indiamart / Alibaba, Excellent verbal communication skills, Analytical", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Mobile and Web Developer,Rajaji Nagar", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=3t9T9eDQ67hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Mobile and Web Developer | Rajaji Nagar | 2 to 5 YearsExperience : 2 to 5 yearsKey Skills : AngularJS, HTML5, JavaScript, Bootstrap, CSS and SASS, UI/UX designing, ReactJS, Backbone.js, Ember.js,Mobile Frameworks,APIs via REST and JSONRoles & Responsibilities- Design and build advanced applications for the Web, IOS, and Android platforms- Strong coding experience in object oriented design, Source Control, Unit testing, documentation, etc- Cross-platform development experience in 1 or more - PhoneGap, Titanium, Google Web Toolkit plus- Unit-test code for robustness, including edge cases, usability and general reliability- Work on bug fixing and improving application performance- Working knowledge of general mobile landscape, architectures, trends & emerging technologiesAbout CompanyDynamic technology firm based out of New York, USA offering software & business development services and also proprietary products. Our mission is to help build smart businesses through strategy consultation, web development and competitive pricing. We value innovation, dedication and kindness.Send CV / Call us to discuss furtherSirisha | HR9380382729/ 78999 29106/ 85480 32880Anjum J | HR74838 93596/ 85537 72172DISHA Recruitment ServicesRT Nagar, Bangalore - 560032", "companyname": "DISHA Recruitment Services", "location": "Bengaluru / Bangalore", "experience": "2 - 5 yrs", "salary": "", "type": "", "skills": "AngularJS, HTML5, JavaScript, Bootstrap, CSS and SASS, UI / UX designing, ReactJS, Backbone.js, Ember.js, Mobile Frameworks, APIs via REST and JSON", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Senior PHP Developer,Rajaji Nagar", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=d8D5Y2VUZnJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Senior PHP Developer | Rajaji Nagar | 2 to 5 yearsQualification : Bachelors degree in Math, Science, Engineering, Statistics, Engineering ManagementExperience : 2 to 5 yearsKey skills : OOP, MVC design patterns, PHP, MongoDB, MySQL schema design, AWS Cloud Computing, Analytics and Search Technologies, NGNIX and Linux system administration, test case writing, test execution and implementation including TDDRoles & Responsibilities- Understand and code requirements quickly and efficiently- Ensure that all code meets the highest standards- Lead the programmers to create best-in-class object-oriented code- Conduct one-on-one code reviews with every programmer to discuss & improve all code produced- Communicate with stakeholders, executive management to understand goals & provide recommendationsAbout CompanyDynamic technology firm based out of New York, USA offering software & business development services and also proprietary products.Our mission is to help build smart businesses through strategy consultation, web development and competitive pricing. We value innovation, dedication and kindness.Send CV / Call us to discuss furtherAnjum | HR7483893596, 8553772172Sirisha M | HR9380382729, 7899929106DISHA Recruitment ServicesBangalore 560032", "companyname": "DISHA Recruitment Services", "location": "Bengaluru / Bangalore", "experience": "2 - 5 yrs", "salary": "", "type": "", "skills": "OOP, MVC design patterns, PHP, MongoDB, MySQL schema design, AWS Cloud Computing, Analytics and Search Technologies, NGNIX and Linux system administration", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Hiring Java Backend/Full stack professionals", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__SLASH__UbVDBqN__PLUS__upzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We have Openings for Java Technology Professionals@ Bngalore/Pune/Hyderabad LocationInterested Candidates share your update cv with below detailsExp in Java:Exp in AWS:Exp in Spring boot:Job Description:Java, HTML, CSS, JavaScriptSpringBoot, Containerization with DockerWeb services with REST (JSON/XML)AWS, Git, Jenkins", "companyname": "CMMI LEVEL 5 COMPANY", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Pune", "experience": "4 - 6 yrs", "salary": "", "type": "", "skills": "java, springboot, aws, docker, spring", "startdate": "", "enddate": "Jun 22, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Trainee Patent Attorneys", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=CC04SCUaQo9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "producing detailed legal descriptions of inventionssubmitting, defending and negotiating patent applicationssupervising and training junior staff (technical assistants)keeping up to date with intellectual property lawproviding associated legal adviceCareer progression within private practices tends to be structured towards partnership. It is also possible to become self-employed, move into a managerial position in industry or become a patent examiner.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "8 - 13 yrs", "salary": "", "type": "", "skills": "legal rights\".\"legal descriptions\".\"Legal firms", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Office Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=tEyJM5htpIhzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Primary point of contact between the executives and internal/external clientsMaintain master corporate calendar of all all-hands events, conferences, holidays and vacationsReceive incoming calls and emails; take messages, respond appropriately and route correspondence to the appropriate executive of staff memberHandle requests, feedback and queries quickly and professionallyMaintain daily electronic journal, arrange meetings and appointments and provide reminders as neededArrange executive travel, hotel and dining arrangements as neededTake dictation and meeting minutes, accurately enter notes and distributeMonitor office supply levels; reorder when appropriateMaintain strong relationships with vendors and keep price data in order to get best pricing on supplies and servicesProduce professional quality reports, presentations and briefsDevelop and carry out an efficient documentation and filing system for both paper and electronic records", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Office Executive, MS Office, Administration, Event Planning", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Sales Development Manager _ Banca channel", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=DWkRNVO0pGZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "For more details call on 9510772611 or share your cv on 9510772611Experience:-compulsory insurance experience requiredPerson from banking sectore should have knowledge of muual fund , life insuranceMin 2-4 years of experience in banking / Indurance channelAge :- 27-38", "companyname": "Supro Consulting", "location": "Bengaluru / Bangalore,  Chennai", "experience": "1 - 4 yrs", "salary": "", "type": "", "skills": "Sales manager, Banca channel, Banking Sales, Insurance sales, BFSI sales, Loan Sales, Mutual Fund sales, Bancassurance, SDM, CAM, Banca, Financial sales, Health insurance", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Admin Operat,Manager,Secretary,Coordinator,Human resource Assist", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=hVQZCIWs1rVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Administrative Operations Manager Office Secretary Administrative Coordinators Administrative Officer Human resources Assistant Managerinvolves ensuring that all administrative operations run in a smooth manner. The manager must be highly experienced in day-to-day operations processes and must serveas the company's authoritative expert on matters concerning administrative operations and procedures.An Office Secretary maintains the smooth running of an office through a variety of administrative and clerical duties. They handle office schedules, coordinate meetings and visits, organize files, answer phones and perform a huge array of other essential tasks.serve as a point of contact and link between employees, internal departments, and external parties, including vendors, lenders, and customers. They handle clericaland administrative duties, analyze and improve office processes and policies, and ensure that the office operates smoothly.is responsible to provide administrative support to an organization. Some duties include inventory management, organizing company records, roster scheduling, budgeting and office reporting, invoicing and customer service. An Assistant Manager is usually responsible for scheduling employees, training new employees, and hiring new employees. Depending on the industry they may also be asked to handle escalated customer complaints as they often work in a customer facing role specialists are responsible for recruiting, screening, interviewing and placing workers. They may also handle employee relations, payroll, benefits, and training.Human resources managers plan, direct and coordinate the administrative functions of an organization.", "companyname": "Lalmua Servcies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Pune,  Bongaigaon", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Administration Manager, Infrastructure, Office-automation, Administrative management, operations and procedures. An Office Secretary, Budgeting Forecasting Planning", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Intern,Finance & Accounts,Financial Analysis", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=lB1ZVXXjHGdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Contribution to the provision of timely and accurate financial information Assist in the co-ordination, preparation and review of Council's financial reports Develop and utilise skills in processing and accounting for accounts payable,receivables and reporting systems Process and review financial data and to ensure the integrity of information within the financial systems, ledger reconciliation", "companyname": "AINEAI Private Limited", "location": "Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Hyderabad/Secunderabad,  Mumbai", "experience": "0 - 2 yrs", "salary": "", "type": "", "skills": "Finance, Accounting, Financial Accounting, Management Accounting, Bookeeping, Microsoft Excel, Financial Budgeting, Financial Management", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Sales Executive-MAdhus", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Wk9nF6gGalJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Hardcore sales job.Greet Customers and pitch for products as per clients' needs.Smart graduates with a flair for sales.Good communication skills mustNegotiating payment and pricing Developing sales strategies Following up on business leads and referrals", "companyname": "Madhus Garage Equipment Pvt Ltd", "location": "Bengaluru / Bangalore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Sales, sales executive, sales officer, area sales officer", "startdate": "", "enddate": "Jun 19, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Business Develoipment", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=uanDgpyqyudzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Generating revenue for the team through educational consulting and by closing sales deals either over the phone or face to face. The candidates will get a chance to rub shoulders with alumni of ISB, IIMs, NITs and various other prestigious institutions of India and the US. Performing candidates may be given opportunities to train and/or lead a team and/or manage important business accounts. Responsibilities Include Generating revenue by counselling prospects and converting them to sales. Converting free app users to paid users using emails, SMS and direct sales. Logging conversations had with prospects on CRM software. Doing resume analysis of prospects; suggesting the right type of master s programs Explaining the importance of higher education and tools to be used to prepare for the process Explaining BYJUs test prep and admissions consulting products Share information on various courses, colleges, test prep products, application process and deadlines on proactive basis for abroad education. Answer questions about products/service and delivering to the need of the customer. Handle B2B counselling in college campuses when required Take and process orders in an accurate manner To be a single point of interface for all customers till conversion. Coordinate with respective team for the product services. Helping the team through training and mentoring", "companyname": "TBS", "location": "Bengaluru / Bangalore", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "business development, direct Sales, b2b sales, b2b, sales, channel sales, b2c sales, client servicing, retail sales, corporate sales", "startdate": "", "enddate": "Aug 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Administration/Secreterial/Clerical Operations,Sale Associate", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Z71R4kSxWDJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Sales RepresentativeSales representatives are responsible for selling a company's products by identifying leads, educating prospects on products through calls, trainings, and presentations, and providing existing customers with exceptional support. Sales representatives are either inside or outside sales reps. Inside sales reps sell products over the phone and online, while outside sales reps sell products through face-to-face meetings. Sales reps span almost every industry.The best sales representatives understand the importance of strong customer service, have a knack for closing deals, and are self-assured.Prospect and qualify new sales leadsSchedule meetings and presentations with prospectsCreate, plan, and deliver presentations on company productsTrack all sales activities in company CRM system and keep current by udpating account information regularlyCommunicate customer and prospect product pain points to appropriate departmentsMaintain a well-developed pipeline of prospectsDevelop strong, ongoing relationships with prospects and customersMeet and/or exceed quotasCoordinate with other team members and departments to optimize the sales effortPresent, promote and sell products/services using solid arguments to existing and prospective customersPerform cost-benefit and needs analysis of existing/potential customers to meet their needsEstablish, develop and maintain positive business and customer relationshipsReach out to customer leads through cold callingExpedite the resolution of customer problems and complaints to maximize satisfactionAchieve agreed upon sales targets and outcomes within scheduleCoordinate sales effort with team members and other departmentsAnalyze the territory/markets potential, track sales and status reportsSupply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.Keep abreast of best practices and promotional trendsContinuously improve through feedback Proven work experience as a Sales RepresentativeExcellent knowledge of MS OfficeFamiliarity with BRM and CRM practices along with ability to build productive business professional relationshipsHighly motivated and target driven with a proven track record in salesExcellent selling, communication and negotiation skillsPrioritizing, time management and organizational skillsAbility to create and deliver presentations tailored to the audience needsRelationship management skills and openness to feedbackBS/BA degree or equivalent", "companyname": "Lalmua Servcies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Pune,  Pondicherry/Puducherry,  Adilabad", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "Sales Manager, Executive, Marketing, Bookeeping, Courier, Store Maintenance, Advertisement Sales, Banking Financial Services, Back Office Operations, Product Engineering", "startdate": "", "enddate": "Aug 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "\"Branch Operation Manager\",Team Leader,Business Analyst", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=gA8iUkNUTHFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Operations Manager Job Responsibilities:Oversees operational systems, processes, and infrastructure while looking for opportunities of improvement or revision.Anticipates and tracks operational and tactical risks and providing strategic solutions.Manages day to day business of the operations department while balancing the responsibilities of various business lines such as business analysis, vendor, and risk management.Works with sales teams to help set and meet daily and quarterly goals.Plays a significant role in long-term planning, project status reporting, and implementing change control processes.Works closely with COO on other special planning and departmental projects.Oversees and reports weekly, monthly, quarterly, and annual metrics.Identifies trends and assess opportunities to improve processes and execution.Completes reasonability testing and information validation prior to circulating findings and recommendations to key stakeholders.Collaborates with other back-office team members to ensure seamless business execution, reinforce positive morale, and uphold company values.Collaborates with transitions and onboarding team as needed.Raises and tracks issues and conflicts, remove barriers, resolve issues of medium complexity involving stakeholders and escalate to appropriate level when required.Assesses a variety of situations and provide clarity to team and stakeholders.Establishes and maintains credible, professional relationships with clients, internal business lines, and external vendors.Solicits and responds to feedback while gaining commitment and support.Supports back-office and firm-wide training programs, reinforcing tech and operations infrastructure between departments to ensure consistency and quality standards are met.Stays up to date on industry regulations, trends, and technology.Works closely with management team to ensure all operational, administrative, and compliance functions within the firm are being properly executed in accordance to regulatory-based best practices.[Work Hours & Benefits]Put the description of your work hours and benefitsin the middle of the job posting to help keep prospective managers reading your advertisement. This paragraph will describe not only standard work hours, but also special working conditions that may apply like flexible hours, work-from-home opportunities, and travel requirements. Also, include office perks like free lunches, commuter benefits, and tuition reimbursement.", "companyname": "Lalmua Servcies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Mumbai", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Coordinator, co ordinator, administrative executive, project coordinator, project manager, program manager", "startdate": "", "enddate": "Aug 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Store Keeper/Warehouse Assistant", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=M9D9fnfcyYZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Room Attendants are responsible for cleaning and servicing guest rooms in order to provide a pleasant and comfortable experience for guests. They ensure that all rooms are inviting and clean and they address all guest queries politely and knowledgeably.ResponsibilitiesRoom service attendants in hotels of all s deliver food, drinks, silverware and condiments to guest rooms to fulfill guest orders. The room service attendant wheels the tray into the guest room with the guests approval, sets up the table, opens platters and identifies each portion. The attendant may check back later to remove the cart. Depending upon the of the hotel, room service attendants also may be responsible for taking guest orders by phone. These servers must be familiar with the hotel menu to answer any guest questions, such as those concerning food allergies. Room service attendants also may deliver packages that arrive for a guest and take care of guests' dry cleaning orders. When they are not delivering items to guest rooms, room service attendants may be responsible for stocking supplies for orders.SkillsRoom service attendants must have excellent people skills in order to communicate politely and professionally with guests and determine whether guests have everything they need during their hotel stay. They must pay attention to detail in order to deliver precisely what the guest has ordered. Attendants must take pride in their personal appearance and maintain the established uniform of the hotel. They also must be capable of standing or walking for long periods of time, as well as be able to push heavy carts.Oversees a restaurant's kitchen by managing other members of the food preparation team, deciding what dishes to serve and adjusting orders to meet guests' requests. May assist in prep work, such as chopping vegetables, but more often will be involved in cooking specialty dishes. Chooses ingredients and designs a menu based on the seasonal availability of food items. Creates unique dishes that inspire guests to come back again and again to see what is new in the restaurant.Oversees a restaurant's kitchen by managing other members of the food preparation team, deciding what dishes to serve and adjusting orders to meet guests' requests. May assist in prep work, such as chopping vegetables, but more often will be involved in cooking specialty dishes.Cooks guests' orders according to their preferencesEmploys food safety best practices and makes sure that all kitchen staff members do the sameActs with appropriate caution in a dangerous environment where there are knives and high-temperature surfacesSelects choice ingredients that will give dishes the best flavourExperiments to come up with new specialties that will draw diners into the restaurantCoaches the sous chef and other members of the kitchen staff, so they perform at their bestDetermines how much food to order and maintains an appropriate supply at the restaurantKeeps up with trends in cooking and the restaurant business to ensure that guests have a positive experienceWorks quickly and accurately during busy periods, such as weekends and eveningsOccasionally takes on extra duties, such as cleaning, when the kitchen is short-staffed or the restaurant is particularly busyTakes direction and works with the restaurant's administrative team.", "companyname": "Lalmua Servcies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Srikakulam,  Tirupati", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Stores, Purchasing, Requisition, Software Development, project manager, senior project manager", "startdate": "", "enddate": "Aug 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "room service attendant,chef cook,House Manager,clearing,sale,hr", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=fSE__SLASH__h3tzQmVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Room Attendants are responsible for cleaning and servicing guest rooms in order to provide a pleasant and comfortable experience for guests. They ensure that all rooms are inviting and clean and they address all guest queries politely and knowledgeably.ResponsibilitiesRoom service attendants in hotels of all s deliver food, drinks, silverware and condiments to guest rooms to fulfill guest orders. The room service attendant wheels the tray into the guest room with the guests approval, sets up the table, opens platters and identifies each portion. The attendant may check back later to remove the cart. Depending upon the of the hotel, room service attendants also may be responsible for taking guest orders by phone. These servers must be familiar with the hotel menu to answer any guest questions, such as those concerning food allergies. Room service attendants also may deliver packages that arrive for a guest and take care of guests' dry cleaning orders. When they are not delivering items to guest rooms, room service attendants may be responsible for stocking supplies for orders.SkillsRoom service attendants must have excellent people skills in order to communicate politely and professionally with guests and determine whether guests have everything they need during their hotel stay. They must pay attention to detail in order to deliver precisely what the guest has ordered. Attendants must take pride in their personal appearance and maintain the established uniform of the hotel. They also must be capable of standing or walking for long periods of time, as well as be able to push heavy carts.Oversees a restaurant's kitchen by managing other members of the food preparation team, deciding what dishes to serve and adjusting orders to meet guests' requests. May assist in prep work, such as chopping vegetables, but more often will be involved in cooking specialty dishes. Chooses ingredients and designs a menu based on the seasonal availability of food items. Creates unique dishes that inspire guests to come back again and again to see what is new in the restaurant.Oversees a restaurant's kitchen by managing other members of the food preparation team, deciding what dishes to serve and adjusting orders to meet guests' requests. May assist in prep work, such as chopping vegetables, but more often will be involved in cooking specialty dishes.Cooks guests' orders according to their preferencesEmploys food safety best practices and makes sure that all kitchen staff members do the sameActs with appropriate caution in a dangerous environment where there are knives and high-temperature surfacesSelects choice ingredients that will give dishes the best flavourExperiments to come up with new specialties that will draw diners into the restaurantCoaches the sous chef and other members of the kitchen staff, so they perform at their bestDetermines how much food to order and maintains an appropriate supply at the restaurantKeeps up with trends in cooking and the restaurant business to ensure that guests have a positive experienceWorks quickly and accurately during busy periods, such as weekends and eveningsOccasionally takes on extra duties, such as cleaning, when the kitchen is short-staffed or the restaurant is particularly busyTakes direction and works with the restaurant's administrative team.", "companyname": "Lalmua Servcies", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Hyderabad/Secunderabad", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Plant Room Operations, room service attendant, Digital Home Domain, Marketing Coordinator, executive marketing, business development associate, chef, sale, HR Marketing", "startdate": "", "enddate": "Aug 13, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Job openings for the role of React JS Senior Software Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=kwDB1PaxZzRzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "JD for React Js At least 5 Years of overall industry experience with 2 yrs of experience in React JS Ability to think from end user's perspective and focused on improving the overall product experience Developer at heart with strong focus to learn and implement latest enhancements in React Native Hands-on experience onJavascript, ECMAScript (OOJS) and JSX Hands-on experience on Web development technology stack, HTML/JS/CSS and other web development libraries and frameworks is an added advantage Complete hands-on on React Native and Java script coding practices and conventions. Ability to coach teams in writing quality code Good communication skill as he will have to engage with the client for understanding Knowledge on Agile Methodology of development, as we are using it for our end to end development and delivery. Candidate should have experience working in Swagger UI", "companyname": "Bask HR", "location": "Bengaluru / Bangalore", "experience": "4 - 9 yrs", "salary": "", "type": "", "skills": "Reactjs", "startdate": "", "enddate": "Aug 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "German Translator-IT Helpdesk-Male Candidates Required", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=mg1GiNzsjAVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Warm Greetings from SP Staffing Services !!We are hiring German Language Translators /IT Helpdesk /Application Support forLeading MNC Compnay (Contract to Hire) !!Role:German Translator-IT Helpdesk /Application SupportExperience Required : 6 to 9 yearsNotice Period :Immediate/Currently Serving/15 days/30 daysWork Location :BangaloreShifts:Rotational Shifts /Night Shifts* Only Male Candidates can applyRequired Skills ,=> Should have experience in German Language Translation=>Should have experience inGerman Language Certification=>Should have experience in IT Helpdesk/Application SupportRegards,Nandhini|8939853066", "companyname": "SP STAFFING SERVICES", "location": "Bengaluru / Bangalore", "experience": "6 - 9 yrs", "salary": "", "type": "", "skills": "German Translator, German Language, German Language Expert, German Translation, German, Helpdesk, tickets, troubleshooting, Application Support", "startdate": "", "enddate": "Aug 12, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Senior Accountant / Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=JovyV__PLUS__K8g9hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Prepares and records asset, liability, revenue, and expenses entries by compiling and analyzing account information.Maintains and balances subsidiary accounts by verifying, allocating, posting, and reconciling transactions and resolving discrepancies.Maintains general ledger by transferring subsidiary accounts, preparing a trial balance, and reconciling entries.Summarizes financial status by collecting information and preparing balance sheet, profit and loss, and other statements.Produces payroll by initiating computer processing; printing checks, verifying finished product.Completes external audit by analyzing and scheduling general ledger accounts and providing information for auditors.Avoids legal challenges by complying with legal requirements.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 3 yrs", "salary": "", "type": "", "skills": "Senior Accountant  /  Manager, Audit, Tally, ERP, Taxation", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Direct  Marketing & Sales Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=VLSq__PLUS__6__SLASH__A24RzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "liaising and networking with a range of stakeholders including customers, colleagues, suppliers and partner organisations;communicating with target audiences and managing customer relationships;sourcing advertising opportunities and placing adverts in the press or on the radio;managing the production of marketing materials, including leaflets, posters, flyers, newsletters, e-newsletters and DVDs;writing and proofreading copy;liaising with designers and printers;organising photo shoots;arranging the effective distribution of marketing materials;maintaining and updating customer databases;organising and attending events such as conferences, seminars, receptions and exhibitions;sourcing and securing sponsorship;conducting market research, for example using customer questionnaires and focus groups;contributing to, and developing, marketing plans and strategies;managing budgets;evaluating marketing campaigns;monitoring competitor activity;supporting the marketing manager and other colleagues.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 4 yrs", "salary": "", "type": "", "skills": "Marketing Executives, Channel Marketing, Marketing Share, Sales  Executives", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Office Assistant", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=WLox__PLUS__6o9rhJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Organize office and assist associates in ways that optimize proceduresSort and distribute communications in a timely mannerCreate and update records ensuring accuracy and validity of informationSchedule and plan meetings and appointmentsMonitor level of supplies and handle shortagesResolve office-related malfunctions and respond to requests or issuesCoordinate with other departments to ensure compliance with established policiesMaintain trusting relationships with suppliers, customers and colleaguesPerform receptionist duties when needed", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 3 yrs", "salary": "", "type": "", "skills": "Office Assistant, Office Service, Facilities Management", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Senior Manager Register Transfer Agent", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=KbE__PLUS__DZHJqgtzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Huge experience in human resource managementSolid knowledge of placement services and proceduresAdvance knowledge of Microsoft office suiteSuperior ability to work under pressureExcellent written and verbal communication skillOutstanding ability to work in a challenging work environmentDeveloped vocational guidance curriculums and programs.Designed industry oriented vocational guidance activities.Participated in conferences and meetings relevant to the job positionInitiated and implemented job prospect enhancing programs.Worked closely with job seekers and job providers.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Training & Placement Officer, Training & Development, Employee Relations", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Marketing Head", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=M__PLUS__3FpLjCKVBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Prepare and manage monthly, quarterly and annual budgets for the Marketing departmentSet, monitor and report on team goalsDesign branding, positioning and pricing strategiesEnsure our brand message is strong and consistent across all channels and marketing efforts (like events, email campaigns, web pages and promotional material)Analyze consumer behavior and determine customer personasIdentify opportunities to reach new market segments and expand market shareCraft quarterly and annual hiring plansMonitor competition (acquisitions, pricing changes and new products and features)Coordinate sales and marketing efforts to boost brand awarenessParticipate in the quarterly and annual planning of company objectives", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Marketing Head, Marketing Research, Marketing Strategy, Digital Marketing", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Personal Secretary", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=5kprvjBi31VzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Applicants must have good communication r written ft spoken English. 2 yrs. renewable contract.Screening phone calls and dealing with enquiries where appropriateMaking appointments and planning their manager s diaryOrganising and attending meetings; sometimes taking minutes and ensuring their manager is well-prepared for meetingsReplying to emails, faxes and postBooking travel arrangements and accommodation when necessaryAssisting with projects their manager might be working on by researching or writing reportsOrganising and maintaining office systemsStanding in for their manager in their absence.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Personal Secretary, Answering Phone Calls, scheduling meetings, emailing", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Accounts Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=hKRpWWJdSSFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Build and maintain strong, long-lasting client relationshipsNegotiate contracts and close agreements to maximize profitsDevelop trusted advisor relationships with key accounts, customer stakeholders and executive sponsorsEnsure the timely and successful delivery of our solutions according to customer needs and objectivesClearly communicate the progress of monthly/quarterly initiatives to internal and external stakeholdersDevelop new business with existing clients and/or identify areas of improvement to meet sales quotasForecast and track key account metrics (e.g. quarterly sales results and annual forecasts)Prepare reports on account statusCollaborate with sales team to identify and grow opportunities within territory", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Accounts Manager, Audit, Tally, ERP, Taxation", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Hiring UI Technology Professionals", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=N__PLUS__YTYcnGlm1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We are currently hiring front end professionals @ Bangalore/Pune LocationInterested candidate drop your cv with below detailsExp in Angular 6:Exp in UI:Job Description:HTML5, CSS,JQuery, AJAX, JavaServer Pages (JSP),JSON, XMLAngularWeb services with REST (JSON/XML)AWS, Git, NPM", "companyname": "CMMI LEVEL 5 COMPANY", "location": "Bengaluru / Bangalore,  Pune", "experience": "4 - 6 yrs", "salary": "", "type": "", "skills": "Ui Developer, Front End Developer angular 6, Css3, Html 5, JavaScript, angular 6, angular", "startdate": "", "enddate": "Jun 22, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Trademark Law Associates", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=7LwUzQcueYpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Legal Officer is required to give legal advice to his clients after studying their cases.Legal Officer needs to conduct meeting with the clients in order to understand the details of their case.Legal Officer is required to stay updated with the information related to the laws and legal processes.Legal Officer working for a company is required to explain the legal issues that may arise due to certain reasons.Legal Officer is required to advise the companys management on the ways to avoid legal issues from arising.Legal Officer needs to give advice on any litigation that may impact the trust.Legal Officer is required to offer legal interpretation service to the company s management on different factors on the present laws and regulatory needs.Legal Officer needs to consult various sources and prepare the policy papers.Legal Officer is required to review the legal matters of the company and work upon managing them efficiently.Legal Officer is required to help his clients in preparing legal documents related to their case.Legal Officer may be required to deal with lawyers and other law personnel to discuss about the case.Legal Officer is required to prepare various legal reports on the cases handled.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "legal, advice legal, legal knowledge", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Officer Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=9Qr__SLASH__yZ3nFONzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "answer phones and transfer to the appropriate staff membertake and distribute accurate messagesgreet public and clients and direct them to the correct staff membercoordinate messenger and courier servicereceive, sort and distribute incoming mailmonitor incoming emails and answer or forward as requiredprepare outgoing mail for distributionfax, scan and copy documentsmaintain office filing and storage systemsupdate and maintain databases such as mailing lists, contact lists and client informationretrieve information when requestedupdate and maintain internal staff contact listsco-ordinate and maintain staff administrative records such as staff parking, staff phones and company credit cardstype documents, reports and correspondenceorganize travel arrangements for staffco-ordinate and organize appointments and meetingsassist with event planning and implementationmonitor and maintain office suppliesensure office equipment is properly maintained and servicedperform work related errands as requested such as going to the post office and bankkeep office area clean and tidy", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 4 yrs", "salary": "", "type": "", "skills": "Office Manager, Office Management, Office Coordinate", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Resident Office Assistant", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=uR9iFGnUy__SLASH__9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Organize office and assist associates in ways that optimize proceduresSort and distribute communications in a timely mannerCreate and update records ensuring accuracy and validity of informationSchedule and plan meetings and appointmentsMonitor level of supplies and handle shortagesResolve office-related malfunctions and respond to requests or issuesCoordinate with other departments to ensure compliance with established policiesMaintain trusting relationships with suppliers, customers and colleaguesPerform receptionist duties when needed", "companyname": "Times of India Ascent", "location": "Bengaluru / Bangalore", "experience": "2 - 3 yrs", "salary": "", "type": "", "skills": "Office Assistant, scheduling meetings, personal assistant, answering phone calls", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Marketing Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=HVREomnR3p5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Identify, negotiate and liaison with variousmarketing agencies for execution.Manage vendors engaged for various requirements, e.g. printing vendor etc.Connect and engage with different housing societies, schools,community centers for conducting promotional activities.Explore different avenues for typing up with societies or nieghbourhoods.Collect data and create appropriate reports.Identify trends and patterns and assist in devising improvedmarketing strategies for different parts of the city.Follow a target based approach for conducting activities.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Marketing Executive , Marketing Strategy, marketing agencies, Market Research", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Receptionist", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=L87va86c7XBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Welcomes visitors by greeting them, in person or on the telephone; answering or referring inquiries.Directs visitors by maintaining employee and department directories; giving instructions.Maintains security by following procedures; monitoring logbook; issuing visitor badges.Maintains telecommunication system by following manufacturer's instructions for house phone and console operation.Maintains safe and clean reception area by complying with procedures, rules, and regulations.Maintains continuity among work teams by documenting and communicating actions, irregularities, and continuing needs.Contributes to team effort by accomplishing related results as needed.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Receptionist, Front Office Executive, Office Management", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Brand Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=7y6GGnGk__PLUS__jNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Shall be responsible for devising marketing strategy of the organization in respect of all real estate projects.Aggressive brand management through latest technologies and communication techniques: Co-ordination with various websites.portals and Agencies: Review marketing and sales collaterals, optimize media spend to maximize brand enhancement and lead generation. Coordinate and organize marketing activities.Graduate in any discipline with relevant experience of minimum 5 years.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Brand Manager, devising marketing strategy, Brand Management , marketing and sales collaterals", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "General Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=qXQ5HThaCQxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Hiring, training, and evaluating employees, taking corrective action when necessary.Developing, reviewing, and improving administrative systems, policies, and procedures.Ensuring office is stocked with necessary supplies and all equipment is working and properly maintained.Working with accounting and management team to set budgets, monitor spending, and processing payroll and other expenses.Planning, scheduling, and promoting office events, including meetings, conferences, interviews, orientations, and training sessions.Collecting, organizing, and storing information using computers and filing systems.Overseeing special projects and tracking progress towards company goals.", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "General Manager, Office Management, Facilities Management, Office Service", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Admin Executive", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=jGJOatOTocxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Primary point of contact between the executives and internal/external clientsMaintain master corporate calendar of all all-hands events, conferences, holidays and vacationsReceive incoming calls and emails; take messages, respond appropriately and route correspondence to the appropriate executive of staff memberHandle requests, feedback and queries quickly and professionallyMaintain daily electronic journal, arrange meetings and appointments and provide reminders as neededArrange executive travel, hotel and dining arrangements as neededTake dictation and meeting minutes, accurately enter notes and distributeMonitor office supply levels; reorder when appropriateMaintain strong relationships with vendors and keep price data in order to get best pricing on supplies and servicesProduce professional quality reports, presentations and briefsDevelop and carry out an efficient documentation and filing system for both paper and electronic recordsDelegate tasks as appropriate to other members of the team", "companyname": "Times Group Publications", "location": "Bengaluru / Bangalore", "experience": "2 - 4 yrs", "salary": "", "type": "", "skills": "Admin Executive, Office Management, Facilities Management, Office Service", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Work From Home for Govt. Regd. ISO Certified Pvt. Ltd. Company", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=9v1sUUcqvDNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "MINANASHIKAa company registered under Ministry of Corporate Affairs- Government of Indiaand having ISO, IAF, MSME, SSL Certificatesand TAN& PAN Cardin company's name, is hiring serious Data Entry Operators who work from home.Candidates must have their Laptop / Desktop at home. Candidates must have good knowledge of MS-Office like Word, Excel and Internet.We have professional mail idfor providing jobs details & Offer letter. We don't use Gmail id.Call / Whats-appour HR @ 9748378025to apply for the post (Only serious candidates) Job DetailsPost :Data Entry OperatorJob Type : Work from Home / Full Time / Contractual JobVacancy : 20Skill :MS Word, MS Excel & InternetTyping Speed : 20 wpm to 30 wpmWorking Hours :Minimum 6 hrs. to 8 hrs. at homeWork Type : Offline work but internet is req. for transferring data to us.Interview : TelephonicTest :Typing Speed & AccuracyJob Training :Online (Only for selected candidates)Projects to be worked on :1) Medical Content Writing2) Data Entry in Excel sheet3) Manual Writing Project4) USA EDU Survey Project5) Digital Parts Form Filling6) Data ProcessingCall / Whats-app HR @ 9748378025to apply for the post (Only serious candidates) For Details Visit our Websites : mshiss.co mNote :We don't claim that the job is very easy and it can be done by anyone spending only 2 hrs. to 3 hrs. daily with great income.We don't have any short cut high income policy.Beware: Some Companies and group of people are posting ads showing our company's project (Job) Demo or image like Excel Numeric, Manual Form Filling etc and using their whatsup no. for chatting for scamming people.Contact us for getting list of scam people and companies.", "companyname": "Manthan Solutions", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Thiruvananthapuram,  Coimbatore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Part time, Freelance, Work From Home, MS Office, Typing, BPO, HR, Home Based, Computer Data Entry, Computer Typing, Computer based Job, Data Typing, Back Office, Data Entry", "startdate": "", "enddate": "Aug 14, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}, {"title": "Senior iOS Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=sUjZdhiDLa9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "As digital transformation continues to accelerate, GrayRipples is seeking for Senior iOS developers who can support our digital journey. Design and engineer end-to-end experiences that help our clients succeed at the speed of innovation. Be a part of building one of the largest technology and business services firms in the world.Apply at the JOBS section in the website Design and build advanced high-quality applications for the iOS platform.Able to handle and manage the projects independently.Someone with an ability to ensure the performance, quality, and responsiveness of applications.Ability to work within a rapidly evolving environment.Provide thought leadership in mobile engineering and bring your passion for technology to motivate and inspire on a day to day basis.Provide detailed estimates of work and ensure timely delivery of features.Produce and ensure delivery of quality, readable, and well-tested code. Review, analyze and resolve application issues as needed.Evaluate strategies and make recommendations on changes and improvements and accomplish goals in a timely manner.Collaborate with team members on the design and implementation of new functionalities on the different platforms.Continuously learn and keep up to date with emerging technologies to evaluate impact to business and member value.", "companyname": "Locus IT Services Private Limited", "location": "Bengaluru / Bangalore", "experience": "3 - 6 yrs", "salary": "", "type": "", "skills": "ios, Iphone, Xcode, Cocoa Touch, Interface Builder, Ios Sdk, Objective C, Swift, API", "startdate": "", "enddate": "Jul 30, 2020 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1592240128.1216102}]